1) importation de la bibliothèque Pandas

In [91]:
import pandas as pd

2) importer le fichier "College_Data.csv" et afficher les 5 premières lignes

In [92]:
df=pd.read_csv("college_data.csv")
df

,Name,private,apps,accept,enroll,full_time,part_time,outstate,room_board,books,personal,prof_phd,prof_terminal,std_by_prof,perc_alumni,grad_rate
0,Abilene Christian University,Yes,1660,1232,721,2885,537,7440,3300,450,2200,70,78,18.1,12,60
1,Adelphi University,Yes,2186,1924,512,2683,1227,12280,6450,750,1500,29,30,12.2,16,56
2,Adrian College,Yes,1428,1097,336,1036,99,11250,3750,400,1165,53,66,12.9,30,54
3,Agnes Scott College,Yes,417,349,137,510,63,12960,5450,450,875,92,97,7.7,37,59
4,Alaska Pacific University,Yes,193,146,55,249,869,7560,4120,800,1500,76,72,11.9,2,15
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
775,Worcester State College,No,2197,1515,543,3089,2029,6797,3900,500,1200,60,60,21.0,14,40
776,Xavier University,Yes,1959,1805,695,2849,1107,11520,4960,600,1250,73,75,13.3,31,83
777,Xavier University of Louisiana,Yes,2097,1915,695,2793,166,6900,4200,617,781,67,75,14.4,20,49
778,Yale University,Yes,10705,2453,1317,5217,83,19840,6510,630,2115,96,96,5.8,49,99
779,York College of Pennsylvania,Yes,2989,1855,691,2988,1726,4990,3560,500,1250,75,75,18.1,28,99

3) Vérifier l'existence de valeurs nulls

In [93]:
df.isna().sum()

Name             0
private          0
apps             0
accept           0
enroll           0
full_time        0
part_time        0
outstate         0
room_board       0
books            0
personal         0
prof_phd         0
prof_terminal    0
std_by_prof      0
perc_alumni      0
grad_rate        0
dtype: int64

4) Vérifier l'existence de doublons (des observations dupliquées)

In [94]:
df.duplicated().sum()

3

In [95]:
df.drop_duplicates(inplace=True)
df.shape

(777, 16)

5) Afficher dans un nouvel dataframe (df1), le nombre d'universités privées et publiques ainsi que le nombre d'étudiants inscrits dans chaque type d'université.

In [96]:
df1=pd.DataFrame()
df1["count"]=df.groupby("private").private.count()
df1["enroll"]=df.groupby("private").enroll.sum()
df1

         count  enroll
private
No         212  347865
Yes        565  258174

6) Afficher pour dans un nouvel Dataframe (df2), le nom et le taux d'acceptation le moins élevé pour chaque type d'université

In [97]:
df21= pd.DataFrame()
df21["private"]=df.private
df21["name"]=df.Name
df21["taux_accep"]=df.accept/df.apps*100
df22=df21.groupby(df21.private).taux_accep.min()
df2=df21.merge(df22)
df2=df2.groupby(df2.private).first()
df2

                           name  taux_accep
private
No       University of Virginia   33.970598
Yes        Princeton University   15.448631

7) Afficher dans un nouvel Dataframe (df3), le nom et le montant d'inscription le plus élevé pour chaque type d'université.

* montant inscription = room_board + books + personal

In [98]:
df31=pd.DataFrame()
df31["Name"]=df.Name
df31["private"]=df.private
df31["total"]=df.room_board+df.books+df.personal
df32=df31.groupby("private").total.max()
df3=df31.merge(df32)
df3.groupby("private").first()

                                      Name  total
private
No       University of Illinois at Chicago   8946
Yes                 Saint Louis University  12330

8) Afficher dans un nouvel DataFrame (df4), pour chaque type d'université, le nom et les nombre le moins élevé des enseignants titulaires d'un diplome de doctorat (prof_phd) et ceux titulaire d'un diplome de master (prof_terminal)

In [99]:
df41=pd.DataFrame()
df41["private"]=df["private"]
df41["Name"]=df["Name"]
df41["prof_phd"]=df.prof_phd
df41["prof_terminal"]=df.prof_terminal
df42=df41.groupby("private").prof_phd.min()
df43=df41.merge(df42)
df44=df41.groupby("private").prof_terminal.min()
df45=df43.merge(df44)
df4=pd.concat([df43,df45],axis=0).groupby(['private','Name']).first()
df4

                                     prof_phd  prof_terminal
private Name
No      West Liberty State College         33             33
Yes     Center for Creative Studies         8             58
        MidAmerica Nazarene College        33             33

9) Afficher dans un nouvel DataFrame(df5), pour chaque type d'université, le nom et le taux etudiant/prof (std_by_prof) le plus elevé

In [100]:
df51=df.filter(items=["private","Name","std_by_prof"])
df52=df51.groupby("private").std_by_prof.max()
df5=df51.merge(df52)
df5.groupby("private").first()

                                Name  std_by_prof
private
No                Mesa State College         28.8
Yes      Indiana Wesleyan University         39.8

10) Afficher dans un nouvel Dataframe(df6), pour chaque type d'université, les noms et les taux de réussite (Name, grad_rate) des 3 universités qui ont le taux de réussite le moins élevé

In [101]:
df51=pd.DataFrame()
df51=df.filter(items=["private","Name","grad_rate"])
df51=df51.sort_values("grad_rate")
df52=df51.groupby("private").grad_rate.head(3)
df5=df51.merge(df52)
df5.groupby(["private","Name"]).first()

                                       grad_rate
private Name
No      Fayetteville State University         24
        Jersey City State College             26
        Lamar University                      26
        Texas Southern University             10
Yes     Alaska Pacific University             15
        Brewton-Parker College                18
        Centenary College                     24
        Montreat-Anderson College             15